Extensions/нп_ДатыЗапретаИзменения/configurator/Reports/нп_ДействующиеДатыЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>нп_ДействующиеДатыЗапрета</Name>
		</Properties>
	</Report>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/InformationRegisters/нп_СостояниеОткрытыхПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>нп_СостояниеОткрытыхПериодов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:DefinedType.АдресатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:Characteristic.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>ЗаявкаНаОткрытиеПериода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.нп_ЗаявкаНаОткрытиеПериода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапретаДоОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаписьБылаУстановленаАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/InformationRegisters/нп_НастройкиАвтоматическойУстановкиДатЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>нп_НастройкиАвтоматическойУстановкиДатЗапрета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:DefinedType.АдресатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.нп_СпособыРасчетаДатыЗапрета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Вариант относительной даты БСП, например КонецПрошлогоМесяца</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДнейРазрешения</Name>
					<Comment>Сдвиг относительной даты, как в типовой форме</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсеРазделыБезОрганизации</Name>
					<Comment>Банк, касса, склад и сценарии: общая дата каждого раздела</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/Reports/нп_ДействующиеДатыЗапрета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задать настройки формы отчета.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения, Неопределено
//  КлючВарианта - Строка, Неопределено
//  Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.ФормироватьСразу = Ложь;
	Настройки.РазрешеноИзменятьВарианты = Истина;
	Настройки.РазрешеноИзменятьСтруктуру = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиКД = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКД, ДанныеРасшифровки);
	
	ВнешниеНаборы = Новый Структура("ДатыЗапрета", ТаблицаДействующихДатЗапрета());
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаДействующихДатЗапрета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДействующихДатЗапрета();
	Запрос.УстановитьПараметр("РазделыБезОрганизации", нп_ДатыЗапретаИзменения.СсылкиРазделовБезОрганизации());
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.ОписаниеДатыЗапрета = нп_ДатыЗапретаИзменения.ПредставлениеОписанияДатыЗапретаОтчета(
			СтрокаТаблицы.ОписаниеДатыЗапрета,
			СтрокаТаблицы.ОписаниеНастройки,
			СтрокаТаблицы.КоличествоДнейРазрешенияНастройки,
			СтрокаТаблицы.СпособРасчетаНастройки,
			СтрокаТаблицы.ЧислоДней);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ТекстЗапросаДействующихДатЗапрета()
	
	Возврат
		"ВЫБРАТЬ
		|	ДатыЗапрета.Пользователь КАК Пользователь,
		|	ДатыЗапрета.Раздел КАК Раздел,
		|	ДатыЗапрета.Объект КАК Объект,
		|	ДатыЗапрета.ДатаЗапрета КАК ДатаЗапрета,
		|	ДатыЗапрета.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
		|	ДатыЗапрета.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА НЕ Состояние.ЗаявкаНаОткрытиеПериода ЕСТЬ NULL
		|			ТОГДА ""Временно открытый период""
		|		КОГДА НЕ ПодобраннаяНастройка.Пользователь ЕСТЬ NULL
		|				ИЛИ ДатыЗапрета.Комментарий ПОДОБНО ""нп_авто%""
		|			ТОГДА ""Автоматическая установка""
		|		ИНАЧЕ ""Установлено вручную""
		|	КОНЕЦ КАК Источник,
		|	ПодобраннаяНастройка.ЧислоДней КАК ЧислоДней,
		|	ПодобраннаяНастройка.ОписаниеДатыЗапрета КАК ОписаниеНастройки,
		|	ПодобраннаяНастройка.КоличествоДнейРазрешения КАК КоличествоДнейРазрешенияНастройки,
		|	ПодобраннаяНастройка.СпособРасчета КАК СпособРасчетаНастройки,
		|	Состояние.ЗаявкаНаОткрытиеПериода КАК ЗаявкаНаОткрытиеПериода,
		|	Состояние.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	Состояние.ЗаявкаНаОткрытиеПериода.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапрета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.нп_СостояниеОткрытыхПериодов КАК Состояние
		|		ПО ДатыЗапрета.Раздел = Состояние.РазделДатыЗапрета
		|			И ДатыЗапрета.Объект = Состояние.ОбъектДатыЗапрета
		|			И ДатыЗапрета.Пользователь = Состояние.Пользователь
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыЗапретаВнутр.Пользователь КАК Пользователь,
		|			ДатыЗапретаВнутр.Раздел КАК Раздел,
		|			ДатыЗапретаВнутр.Объект КАК Объект,
		|			МАКСИМУМ(Настройки.ЧислоДней) КАК ЧислоДней,
		|			МАКСИМУМ(Настройки.ОписаниеДатыЗапрета) КАК ОписаниеДатыЗапрета,
		|			МАКСИМУМ(Настройки.КоличествоДнейРазрешения) КАК КоличествоДнейРазрешения,
		|			МАКСИМУМ(Настройки.СпособРасчета) КАК СпособРасчета
		|		ИЗ
		|			РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаВнутр
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.нп_НастройкиАвтоматическойУстановкиДатЗапрета КАК Настройки
		|				ПО Настройки.Включено
		|					И (ВЫБОР
		|						КОГДА Настройки.Пользователь = НЕОПРЕДЕЛЕНО
		|								ИЛИ Настройки.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|								ИЛИ Настройки.Пользователь = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка)
		|								ИЛИ Настройки.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ПустаяСсылка)
		|								ИЛИ Настройки.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехПользователей)
		|							ТОГДА ДатыЗапретаВнутр.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехПользователей)
		|						ИНАЧЕ Настройки.Пользователь = ДатыЗапретаВнутр.Пользователь
		|					КОНЕЦ)
		|					И (ВЫБОР
		|						КОГДА Настройки.ВсеРазделыБезОрганизации
		|							ТОГДА ДатыЗапретаВнутр.Объект = ДатыЗапретаВнутр.Раздел
		|								И ДатыЗапретаВнутр.Раздел В (&РазделыБезОрганизации)
		|						КОГДА Настройки.ОбъектДатыЗапрета = НЕОПРЕДЕЛЕНО
		|								ИЛИ Настройки.ОбъектДатыЗапрета = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|								ИЛИ Настройки.ОбъектДатыЗапрета = ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
		|								ИЛИ Настройки.ОбъектДатыЗапрета = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|								ИЛИ Настройки.ОбъектДатыЗапрета = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
		|								ИЛИ Настройки.ОбъектДатыЗапрета = ЗНАЧЕНИЕ(Справочник.Сценарии.ПустаяСсылка)
		|								ИЛИ Настройки.ОбъектДатыЗапрета = ЗНАЧЕНИЕ(Справочник.СценарииТоварногоПланирования.ПустаяСсылка)
		|							ТОГДА ДатыЗапретаВнутр.Раздел = Настройки.РазделДатыЗапрета
		|								И ДатыЗапретаВнутр.Объект = ДатыЗапретаВнутр.Раздел
		|						КОГДА Настройки.РазделДатыЗапрета = НЕОПРЕДЕЛЕНО
		|								ИЛИ Настройки.РазделДатыЗапрета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка)
		|							ТОГДА ДатыЗапретаВнутр.Объект = Настройки.ОбъектДатыЗапрета
		|						ИНАЧЕ ДатыЗапретаВнутр.Объект = Настройки.ОбъектДатыЗапрета
		|							И ДатыЗапретаВнутр.Раздел = Настройки.РазделДатыЗапрета
		|					КОНЕЦ)
		|		СГРУППИРОВАТЬ ПО
		|			ДатыЗапретаВнутр.Пользователь,
		|			ДатыЗапретаВнутр.Раздел,
		|			ДатыЗапретаВнутр.Объект) КАК ПодобраннаяНастройка
		|		ПО ДатыЗапрета.Раздел = ПодобраннаяНастройка.Раздел
		|			И ДатыЗапрета.Объект = ПодобраннаяНастройка.Объект
		|			И ДатыЗапрета.Пользователь = ПодобраннаяНастройка.Пользователь";
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
